---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingPresetIndex
source: html/aaeeaaeb-6655-cb2d-3a79-c49f81500218.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingPresetIndex Property

"Lighting presets combo"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyLightingPresetIndex { get; }
```